/**
 * java反射基础
 */
public class reflectBasic {

    /**
     * 一、 什么是反射？
     *      Java反射就是在运行状态中，对于任意一个类，都能够知道这个类的所有属性和
     *   方法；对于任意一个对象，都能够调用它的任意方法和属性；并且能改变它的属性。
     *   而这也是Java被视为动态（或准动态，为啥要说是准动态，因为一般而言的动态语言
     *   定义是程序运行时，允许改变程序结构或变量类型，这种语言称为动态语言。从这个
     *   观点看，Perl，Python，Ruby是动态语言，C++，Java，C#不是动态语言。）语言
     *   的一个关键性质。
     *
     *二、 反射能做什么？
     *      我们知道反射机制允许程序在运行时取得任何一个已知名称的class的内部信息，
     *   包括包括其modifiers(修饰符)，fields(属性)，methods(方法)等，并可于运行
     *   时改变fields内容或调用methods。那么我们便可以更灵活的编写代码，代码可以在
     *   运行时装配，无需在组件之间进行源代码链接，降低代码的耦合度；还有动态代理的实
     *   现等等；但是需要注意的是反射使用不当会造成很高的资源消耗！
     *
     */
}
